"""
Завдання 1 - Оптимізація виробництва

Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік". 
Для виробництва цих напоїв використовуються різні інгредієнти та обмежена кількість обладнання. 
Задача полягає у максимізації виробництва, враховуючи обмежені ресурси.

Умови завдання:

1. "Лимонад" виготовляється з "Води", "Цукру" та "Лимонного соку".
2. "Фруктовий сік" виготовляється з "Фруктового пюре" та "Води".
3. Обмеження ресурсів: 100 од. "Води", 50 од. "Цукру", 30 од. "Лимонного соку" та 40 од. "Фруктового пюре".
4. Виробництво одиниці "Лимонаду" вимагає 2 од. "Води", 1 од. "Цукру" та 1 од. "Лимонного соку".
5. Виробництво одиниці "Фруктового соку" вимагає 2 од. "Фруктового пюре" та 1 од. "Води".

Використовуючи PuLP, створіть модель, яка визначає, скільки "Лимонаду" та "Фруктового соку" 
потрібно виробити для максимізації загальної кількості продуктів, дотримуючись обмежень на ресурси. 
Напишіть програму, код якої максимізує загальну кількість вироблених продуктів 
"Лимонад" та "Фруктовий сік", враховуючи обмеження на кількість ресурсів.

"""

import pulp

model = pulp.LpProblem("Maximize_Products_Production", pulp.LpMaximize)

x1 = pulp.LpVariable("Lemonade", lowBound=0, cat="Integer")
x2 = pulp.LpVariable("Fruit_Juice", lowBound=0, cat="Integer")

model += 2 * x1 + x2 <= 100
model += x1 <= 50
model += x1 <= 30
model += 2 * x2 <= 40
model += x1 + x2

model.solve()

print("Optimal Production of Lemonade:", pulp.value(x1))
print("Optimal Production of Fruit Juice:", pulp.value(x2))
print("Maximum Total Production:", pulp.value(model.objective))
