"""
Завдання

У конспекті ми розглянули приклад про розбиття суми на монети. 
Маємо набір монет [50, 25, 10, 5, 2, 1]. Уявіть, що ви розробляєте систему для касового апарату, 
яка повинна визначити оптимальний спосіб видачі решти покупцеві.

Вам необхідно написати дві функції для касової системи, яка видає решту покупцеві:

1. Функція жадібного алгоритму find_coins_greedy. Ця функція повинна приймати суму, 
яку потрібно видати покупцеві, і повертати словник із кількістю монет кожного номіналу, 
що використовуються для формування цієї суми. Наприклад, 
для суми 113 це буде словник {50: 2, 10: 1, 2: 1, 1: 1}. 
Алгоритм повинен бути жадібним, тобто спочатку вибирати найбільш доступні номінали монет.

2. Функція динамічного програмування find_min_coins. 
Ця функція також повинна приймати суму для видачі решти, 
але використовувати метод динамічного програмування, щоб знайти мінімальну кількість монет, 
необхідних для формування цієї суми. 
Функція повинна повертати словник із номіналами монет та їх кількістю для досягнення заданої суми 
найефективнішим способом. Наприклад, для суми 113 це буде словник {1: 1, 2: 1, 10: 1, 50: 2}

Порівняйте ефективність жадібного алгоритму та алгоритму динамічного програмування, 
базуючись на часі їх виконання або О великому та звертаючи увагу на їхню продуктивність при великих сумах. 
Висвітліть, як вони справляються з великими сумами та чому один алгоритм може бути більш ефективним 
за інший у певних ситуаціях. Свої висновки додайте у файл readme.md домашнього завдання.

"""


def find_coins_greedy(amount):
    coins = [50, 25, 10, 5, 2, 1]
    coins_count = {}
    for coin in coins:
        coin_count = amount // coin
        if coin_count > 0:
            coins_count[coin] = coin_count
            amount -= coin * coin_count
        if amount == 0:
            break
    return coins_count


def find_min_coins(amount):
    coins = [50, 25, 10, 5, 2, 1]
    dp = [float("inf")] * (amount + 1)
    dp[0] = 0
    used_coins = [-1] * (amount + 1)

    for i in range(1, amount + 1):
        for coin in coins:
            if i >= coin and dp[i - coin] + 1 < dp[i]:
                dp[i] = dp[i - coin] + 1
                used_coins[i] = coin

    result = {}
    remaining_amount = amount
    while remaining_amount > 0:
        coin = used_coins[remaining_amount]
        result[coin] = result.get(coin, 0) + 1
        remaining_amount -= coin

    sorted_result = dict(sorted(result.items()))
    return sorted_result


amount = 113
print("Жадібний алгоритм:", find_coins_greedy(amount))
print("Динамічне програмування:", find_min_coins(amount))
